![title](https://miro.medium.com/max/481/1*cxfqR8NAj8HGal8CVOZ7hg.png)

#  Python Pandas: Tips & Tricks

# #33: Menampilkan Nilai Kumulatif (cummulative)

## Import Modules

- Kode di bawah ini untuk memberi tahu berapa versi pandas kalian

In [1]:
import pandas as pd

print(pd.__version__)

1.1.3

## Persiapan Data Frame

In [18]:
d = {'pemain':['Bobby', 'Jackson', 'Bobby', 'JB', 'JB', 'Jackson', 'Mark', 'Mark'],
     'goal':[2, 1, 3, 1, 1, 2, 2, 3]}
df = pd.DataFrame(d)
df

    pemain  goal
0    Bobby     2
1  Jackson     1
2    Bobby     3
3       JB     1
4       JB     1
5  Jackson     2
6     Mark     2
7     Mark     3

## Menampilkan Nilai Kumulatif (cummulative)

- `cumsum()` adalah cummulative sum

In [19]:
df['goal'].cumsum().to_frame()

   goal
0     2
1     3
2     6
3     7
4     8
5    10
6    12
7    15

- Menampilkan data secara keseluruhan dan akan membentuk sebuah kolom baru
- Kolom baru tersebut akan menampung nilai komulatif sum dari kolom sebelumnya yaitu kolom `gol`

In [20]:
df['jumlah_goal_kumulatif'] = df['goal'].cumsum()
df

    pemain  goal  jumlah_goal_kumulatif
0    Bobby     2                      2
1  Jackson     1                      3
2    Bobby     3                      6
3       JB     1                      7
4       JB     1                      8
5  Jackson     2                     10
6     Mark     2                     12
7     Mark     3                     15

- Menerapkan kumulatif sum untuk setiap kelompok pemainnya

In [21]:
df['jumlah_goal_kumulatif_tiap_pemain'] = df.groupby('pemain')['goal'].cumsum()
df

    pemain  goal  jumlah_goal_kumulatif  jumlah_goal_kumulatif_tiap_pemain
0    Bobby     2                      2                                  2
1  Jackson     1                      3                                  1
2    Bobby     3                      6                                  5
3       JB     1                      7                                  1
4       JB     1                      8                                  2
5  Jackson     2                     10                                  3
6     Mark     2                     12                                  2
7     Mark     3                     15                                  5

- Menerapkan fungsi kumulatif lain, yaitu `cummax()` atau `cummulative max`
- `cummax()` akan mendata nilai tertinggi yang diperoleh sampai dengan titik tertentu

In [22]:
df['cummax'] = df['goal'].cummax()
df

,pemain,goal,jumlah_goal_kumulatif,jumlah_goal_kumulatif_tiap_pemain,cummax
0,Bobby,2,2,2,2
1,Jackson,1,3,1,2
2,Bobby,3,6,5,3
3,JB,1,7,1,3
4,JB,1,8,2,3
5,Jackson,2,10,3,3
6,Mark,2,12,2,3
7,Mark,3,15,5,3

- `cummin()` akan mendata nilai terendah secara kumulatif

In [23]:
df['cummin'] = df['goal'].cummin()
df

,pemain,goal,jumlah_goal_kumulatif,jumlah_goal_kumulatif_tiap_pemain,cummax,cummin
0,Bobby,2,2,2,2,2
1,Jackson,1,3,1,2,1
2,Bobby,3,6,5,3,1
3,JB,1,7,1,3,1
4,JB,1,8,2,3,1
5,Jackson,2,10,3,3,1
6,Mark,2,12,2,3,1
7,Mark,3,15,5,3,1

- `cumprod()` merupakan hasil total perkalian kumulatif

In [24]:
df['cumprod'] = df['goal'].cumprod()
df

,pemain,goal,jumlah_goal_kumulatif,jumlah_goal_kumulatif_tiap_pemain,cummax,cummin,cumprod
0,Bobby,2,2,2,2,2,2
1,Jackson,1,3,1,2,1,2
2,Bobby,3,6,5,3,1,6
3,JB,1,7,1,3,1,6
4,JB,1,8,2,3,1,6
5,Jackson,2,10,3,3,1,12
6,Mark,2,12,2,3,1,24
7,Mark,3,15,5,3,1,72

# #34: Mapping pada Data Frame dengan `applymap()`

## Import Modules

- Kode di bawah ini untuk memberi tahu berapa versi pandas kalian

In [10]:
import pandas as pd

print(pd.__version__)

1.1.3

## Persiapan Data Frame

- Menstandarisasi terkait data yang tersimpan dalam database

In [16]:
Df = pd.DataFrame({'jenis_kelamin':['Pria', 'Wanita', 'lelaki', 'Lelaki', 'perempuan'],
                  'usia':[23, 21, 24, 22, 21],
                  'shift':['pagi', 'siang', 'Malam', 'Siang', 'pagi']})
Df

  jenis_kelamin  usia  shift
0          Pria    23   pagi
1        Wanita    21  siang
2        lelaki    24  Malam
3        Lelaki    22  Siang
4     perempuan    21   pagi

## Mapping pada Data Frame dengan `applymap()`

- `applymap()` dalam pandas untuk menerapkan suatu fungsi pada keseluruhan data frame

In [25]:
Df = Df.applymap(lambda x:x.lower() if type(x) == str else x)
Df

  jenis_kelamin  usia  shift
0          pria    23   pagi
1        wanita    21  siang
2        lelaki    24  malam
3        lelaki    22  siang
4     perempuan    21   pagi

## `applymap()` dengan Dictionary

- Dictionary akan melakukan proses mapping terkait dengan data-data pada data frame di atas

In [26]:
mapping = {'pria':'L',
           'lelaki':'L',
           'wanita':'P',
           'perempuan':'P',
           'pagi':1,
           'siang':2,
           'malam':3}

Df.applymap(mapping.get)

  jenis_kelamin  usia  shift
0             L  None      1
1             P  None      2
2             L  None      3
3             L  None      2
4             P  None      1

In [27]:
Df[['jenis_kelamin', 'shift']] = Df[['jenis_kelamin', 'shift']].applymap(mapping.get)

Df

  jenis_kelamin  usia  shift
0             L    23      1
1             P    21      2
2             L    24      3
3             L    22      2
4             P    21      1

# #35: Memadukan fungsi agregasi dengan `transform()`

## Import Modules

- Kode di bawah ini untuk memberi tahu berapa versi pandas kalian

In [28]:
import pandas as pd

print(pd.__version__)

1.1.3

## Persiapan Data Frame

- Data frame di bawah menggambarkan transaksi dari suatu coffee shop

In [29]:
d = {'no_nota':[1, 1, 1, 2, 2, 3, 4, 5],
     'kopi':['latte', 'cappuccino', 'espresso', 'latte', 'espresso', 'cappuccino', 'latte', 'espresso'],
     'harga':[50, 60, 80, 150, 120, 60, 100, 40]}
df = pd.DataFrame(d)
df

   no_nota        kopi  harga
0        1       latte     50
1        1  cappuccino     60
2        1    espresso     80
3        2       latte    150
4        2    espresso    120
5        3  cappuccino     60
6        4       latte    100
7        5    espresso     40

## Menghitung Total Harga Untuk Tiap Nomor Nota

- Mengelompokan data-data berdasarkan `nomor nota`
- Pada kolom harga akan dikenakan fungsi agregasi, yaitu `sum()`

In [30]:
df.groupby('no_nota')['harga'].sum().to_frame()

         harga
no_nota
1          190
2          270
3           60
4          100
5           40

- Data di atas akan dimasukkan ke dalam data frame sebagai kolom baru dengan nama kolom `total_harga`

In [31]:
df['total_harga'] = df.groupby('no_nota')['harga'].transform(sum)
df

   no_nota        kopi  harga  total_harga
0        1       latte     50          190
1        1  cappuccino     60          190
2        1    espresso     80          190
3        2       latte    150          270
4        2    espresso    120          270
5        3  cappuccino     60           60
6        4       latte    100          100
7        5    espresso     40           40

## Menghitung Total Omset Untuk Tiap Jenis Kopi Yang Terjual

- Pengelompokan data frame berdasarkan coffee
- Menerapkan fungsi `sum()` terhadap kolom harga

In [32]:
df.groupby('kopi')['harga'].sum().to_frame()

            harga
kopi
cappuccino    120
espresso      240
latte         300

In [33]:
df['total_omset'] = df.groupby('kopi')['harga'].transform(sum)
df

   no_nota        kopi  harga  total_harga  total_omset
0        1       latte     50          190          300
1        1  cappuccino     60          190          120
2        1    espresso     80          190          240
3        2       latte    150          270          300
4        2    espresso    120          270          240
5        3  cappuccino     60           60          120
6        4       latte    100          100          300
7        5    espresso     40           40          240

# #36: Menyatukan kolom dengan `str.cat()`

## Import Modules

- Kode di bawah ini untuk memberi tahu berapa versi pandas kalian

In [34]:
import pandas as pd

print(pd.__version__)

1.1.3

## Persiapan Data Frame

- `pd.DataFrame` adalah proses untuk membentuk object dalam data frame

In [35]:
data = {'nama':['Mark', 'Jackson', 'Jessica', 'Somi'],
        'jenis_kelamin':['L', 'L', 'P', 'P'],
        'usia':[28, 27, 32, 20]}

df = pd.DataFrame(data)
df

      nama jenis_kelamin  usia
0     Mark             L    28
1  Jackson             L    27
2  Jessica             P    32
3     Somi             P    20

## Menyatukan Kolom Dengan `str.cat()`

- Memadukan dua nilai yang tertampung dalam dua kolom berbeda selama kedua nilai tersebut memiliki tipe data string

In [36]:
df['nama'].str.cat(df['jenis_kelamin'], sep=', ').to_frame()

         nama
0     Mark, L
1  Jackson, L
2  Jessica, P
3     Somi, P

- Membentuk kolom baru untuk menampung data di atas dengan nama kolom, yaitu `nama_jk`

In [37]:
df['nama_jk'] = df['nama'].str.cat(df['jenis_kelamin'], sep=', ')
df

      nama jenis_kelamin  usia     nama_jk
0     Mark             L    28     Mark, L
1  Jackson             L    27  Jackson, L
2  Jessica             P    32  Jessica, P
3     Somi             P    20     Somi, P

- Memadukan dua data dengan tipe data yang berbeda, yaitu string dan integer
- mengonversikan tipe data integer menjadi string terlebih dahulu dengan menggunakan metode `astype`

In [38]:
df['nama'].str.cat(df['usia'].astype('str'), sep=' - ').to_frame()

           nama
0     Mark - 28
1  Jackson - 27
2  Jessica - 32
3     Somi - 20

In [39]:
df['nama_usia'] = df['nama'].str.cat(df['usia'].astype('str'), sep=' - ').to_frame()
df

      nama jenis_kelamin  usia     nama_jk     nama_usia
0     Mark             L    28     Mark, L     Mark - 28
1  Jackson             L    27  Jackson, L  Jackson - 27
2  Jessica             P    32  Jessica, P  Jessica - 32
3     Somi             P    20     Somi, P     Somi - 20